app/views/baskets/show.html.erb

SELECT "basket_items".* FROM "basket_items" WHERE "basket_items"."basket_id" = ?  [["basket_id", 2]]
---
  <tbody>
    <% @basket.basket_items.each do |item| %>