my-alcohol-free-wines/app/views/baskets/show.html.erb

SELECT "basket_items".* FROM "basket_items" WHERE "basket_items"."basket_id" = ?  [["basket_id", 2]]
---
<h2>Your Shopping Basket</h2>
<% @basket.basket_items.each do |item| %>