my-alcohol-free-wines/app/controllers/basket_items_controller.rb

SELECT "basket_items".* FROM "basket_items"
---
  def index
    @basket_items = BasketItem.all

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "basket_items" ("wine_id", "quantity", "basket_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["wine_id", 2], ["quantity", 5], ["basket_id", 2], ["created_at", "2015-11-29 16:39:27.330548"], ["updated_at", "2015-11-29 16:39:27.330548"]]
INSERT INTO "baskets" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-26 22:46:47.811992"], ["updated_at", "2015-11-26 22:46:47.811992"]]
---
  def create()
    # Try and get the logged in user's basket from the session hash
    @basket = get_user_basket

    # Try and find the wine the customer has tried to add to their basket
    wine = Wine.find(params[:wine_id])

    # Get the quantity of the wine they want to add to their basket from
    # the request parameters
    wine_quantity = params[:quantity]

    # Build a relationship between the wine_id and its quantity and the basket_id
    @basket_item = @basket.basket_items.build(wine: wine, quantity: wine_quantity)

    respond_to do |format|
      if @basket_item.save

UPDATE "basket_items" SET "quantity" = ?, "updated_at" = ? WHERE "basket_items"."id" = ?  [["quantity", 999], ["updated_at", "2015-11-29 19:40:06.960213"], ["id", 30]]
DELETE FROM "basket_items" WHERE "basket_items"."id" = ?  [["id", 2]]
---
  def destroy
    # Check if the quantity of the basket item the user wants to remove from their
    # basket is greater than 1. If so, reduce the quantity by 1.
    if @basket_item.quantity > 1
      @basket_item.update_attribute(:quantity, @basket_item.quantity - 1)
    else
      # Otherwuse, destroy the link between the basket and the wine
      @basket_item.destroy

SELECT  "basket_items".* FROM "basket_items" WHERE "basket_items"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_basket_item
      @basket_item = BasketItem.find(params[:id])