my-alcohol-free-wines/app/controllers/baskets_controller.rb

SELECT "baskets".* FROM "baskets"
---
  def index
    @baskets = Basket.all

SELECT  "baskets".* FROM "baskets" WHERE "baskets"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_basket
      @basket = Basket.find(params[:id])