my-alcohol-free-wines/app/controllers/sessions_controller.rb

  def create
    # Try and find the email given in the login view in the customers table using
    # ActiveRecord. Email given by customer is converted to lowercase to do case insensitive
    # string matching.
    customer_logging_in = Customer.find_by(email: params[:session][:email].downcase)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT 1  [["email", "d@d.com"]]