my-alcohol-free-wines/app/controllers/wines_controller.rb

  def index
    # TODO Need some way of only inserting the thing to the database if
    # it's not already in there - perhaps do this with a unique identifier
    #
    # result_wine = find_by_ISBN(isbn: isbn)
    # if result_wine == nil or result_wine.price > this_wine.price
    #   add_wine_to_database
    #
    # Wine.delete_all
    #
    # Need to also get the wines from the other supplier and only display the cheapest wine

    # Make a GET request to the URL using the third party gem "rest_client"
    raw_response = RestClient.get(WINES_SUPPLIER_1_URL)

    # Convert the result of the request to JSON
    jsonised_response = JSON.parse(raw_response)

    # For each item in the received JSON
    for item in jsonised_response['wines'] do

      # Try and find the current wine from the JSON object in the wines table by
      # looking for one with an identical barcode
      result_wine = Wine.find_by(barcode: item['barcode'])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."barcode" = ? LIMIT 1  [["barcode", "091234"]]

        new_wine.barcode = item['barcode']

        # Save the wine to the database table when the attributes have been set
        new_wine.save
---
INSERT INTO "wines" ("short_description", "bottle_size", "price", "long_description", "origin_country", "company", "grape_type", "is_vegetarian", "image_url", "barcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    end

    # Now look for the wines needed, passing the search query from the view to the Wine model
    @wines = Wine.search(params[:search_query]).order(:short_description).paginate(page: params[:page], per_page: 10)
---
SELECT  "wines".* FROM "wines" WHERE (short_description LIKE 'Alcohol%')  ORDER BY "wines"."short_description" ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "wines" WHERE (short_description LIKE '%alcohol%')

  def create
    @wine = Wine.new(wine_params)

    respond_to do |format|
      if @wine.save
---
INSERT INTO "wines" ("short_description", "bottle_size", "price", "long_description", "origin_country", "company", "grape_type", "is_vegetarian", "picture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @wine.update(wine_params)
---
UPDATE "wines" SET "picture_id" = ?, "updated_at" = ? WHERE "wines"."id" = ?  [["picture_id", 7], ["updated_at", "2015-11-25 00:33:23.703718"], ["id", 6]]

  def destroy
    @wine.destroy
---
DELETE FROM "wines" WHERE "wines"."id" = ?  [["id", 7]]

    def set_wine
      @wine = Wine.find(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", nil]]