app/controllers/basket_items_controller.rb

SELECT "basket_items".* FROM "basket_items"
---
  def index
    @basket_items = BasketItem.all

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "basket_items" ("wine_id", "quantity", "basket_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["wine_id", 2], ["quantity", 5], ["basket_id", 2], ["created_at", "2015-11-29 16:39:27.330548"], ["updated_at", "2015-11-29 16:39:27.330548"]]
INSERT INTO "baskets" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-26 22:46:47.811992"], ["updated_at", "2015-11-26 22:46:47.811992"]]
---
  def create()
    @basket = get_user_basket
    wine = Wine.find(params[:wine_id])
    @basket_item = @basket.basket_items.build(wine: wine)
    # @basket_item = BasketItem.new(basket_item_params)

    respond_to do |format|
      if @basket_item.save

DELETE FROM "basket_items" WHERE "basket_items"."id" = ?  [["id", 2]]
---
  def destroy
    @basket_item.destroy

SELECT  "basket_items".* FROM "basket_items" WHERE "basket_items"."id" = ? LIMIT 1  [["id", 6]]
---
    def set_basket_item
      @basket_item = BasketItem.find(params[:id])