app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("name", "address", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test User 1"], ["address", "1 Nowhere Lane"], ["email", "testuser1@testdomain.com"], ["created_at", "2015-11-29 21:43:57.613037"], ["updated_at", "2015-11-29 21:43:57.613037"]]