app/controllers/sessions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT 1  [["email", "d@d.com"]]
---
  def create
    customer_logging_in = Customer.find_by(email: params[:session][:email].downcase)