app/controllers/wines_controller.rb

  def index
    # TODO Need some way of only inserting the thing to the database if
    # it's not already in there - perhaps do this with a unique identifier
    #
    # find_by_ISBN for example. if this returns something other than nil, don't add it
    #
    # Wine.delete_all
    #
    # Need to also get the wines from the other supplier and only display the cheapest wine

    index_url = "#{API_ROOT}wines/"
    raw_response = RestClient.get(index_url)

    jsonised_response = JSON.parse(raw_response)

    for item in jsonised_response['wines'] do
      new_wine = Wine.new
      new_wine.short_description = item['short_description']
      new_wine.bottle_size = item['bottle_size']
      new_wine.price = item['price']
      new_wine.long_description = item['long_description']
      new_wine.origin_country = item['origin_country']
      new_wine.company = item['company']
      new_wine.grape_type = item['grape_type']
      new_wine.is_vegetarian = item['is_vegetarian']
      new_wine.image_url = item['image_url']
      new_wine.save
    end

    # REFERENCE THIS LINE IS FROM http://railscasts.com/episodes/37-simple-search-form?autoplay=true
    @wines = Wine.search(params[:search]).order(:short_description).paginate(page: params[:page], per_page: 6)
---
INSERT INTO "wines" ("short_description", "bottle_size", "price", "long_description", "origin_country", "company", "grape_type", "is_vegetarian", "image_url", "barcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "wines".* FROM "wines"  ORDER BY "wines"."short_description" ASC
SELECT COUNT(*) FROM "wines" WHERE (short_description LIKE '%alcohol%')

  def create
    @wine = Wine.new(wine_params)

    respond_to do |format|
      if @wine.save
---
INSERT INTO "wines" ("short_description", "bottle_size", "price", "long_description", "origin_country", "company", "grape_type", "is_vegetarian", "picture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @wine.update(wine_params)
---
UPDATE "wines" SET "picture_id" = ?, "updated_at" = ? WHERE "wines"."id" = ?  [["picture_id", 7], ["updated_at", "2015-11-25 00:33:23.703718"], ["id", 6]]

  def destroy
    @wine.destroy
---
DELETE FROM "wines" WHERE "wines"."id" = ?  [["id", 7]]

    def set_wine
      @wine = Wine.find(params[:id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", nil]]